una1veritas/ARMWork/STM32Libraries/cmperiphlib/TouchPanel/XPT2046.h
/*********************************************************************************************************
*
* File                : TouchPanel.h
* Hardware Environment: 
* Build Environment   : RealView MDK-ARM  Version: 4.20
* Version             : V1.0
* By                  : 
*
*                                  (c) Copyright 2005-2011, WaveShare
*                                       http://www.waveshare.net
*                                          All Rights Reserved
*
*********************************************************************************************************/

#ifndef _TOUCHPANEL_H_
#define _TOUCHPANEL_H_

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx.h"

#include "armcore.h"
#include "spistruct.h"

/* Private typedef -----------------------------------------------------------*/
typedef	struct POINT 
{
   uint16_t x;
   uint16_t y;
} Coordinate;


typedef struct Matrix 
{						
long double An,  
            Bn,     
            Cn,   
            Dn,    
            En,    
            Fn,     
            Divider ;
} Matrix ;

typedef struct __TouchPadStruct {
	SPIStruct * spi;
	GPIOPin pin_sck, pin_si, pin_so, pin_cs, pin_irq;
 Coordinate ScreenSample[3];
 Coordinate DisplaySample[3];
 Matrix matrix ;
 Coordinate  display ;
} TouchPadStruct;

/* Private variables ---------------------------------------------------------*/

extern TouchPadStruct TPStruct;

/* Private define ------------------------------------------------------------*/

#define	CHX 	0x90
#define	CHY 	0xd0


#define TP_CS(x)	x ? GPIO_SetBits(GPIOC,GPIO_Pin_4): GPIO_ResetBits(GPIOC,GPIO_Pin_4)

#define TP_INT_IN   GPIO_ReadInputDataBit(GPIOC,GPIO_Pin_5)

/* Private function prototypes -----------------------------------------------*/				
void TP_Init(GPIOPin sck, GPIOPin si, GPIOPin so, GPIOPin cs, GPIOPin irq);	
Coordinate *Read_Ads7846(void);
void TouchPanel_Calibrate(void);
void DrawCross(uint16_t Xpos,uint16_t Ypos);
void TP_DrawPoint(uint16_t Xpos,uint16_t Ypos);
FunctionalState setCalibrationMatrix( Coordinate * displayPtr,Coordinate * screenPtr,Matrix * matrixPtr);
FunctionalState getDisplayPoint(Coordinate * displayPtr,Coordinate * screenPtr,Matrix * matrixPtr );

#endif

/*********************************************************************************************************
      END FILE
*********************************************************************************************************/


